Tekla.Structures.Filtering.OperatorType
The operator type defines the operators between two filter expressions.

Tekla.Structures.Filtering.OperatorType.IS_EQUAL
The "is equal" operator.

Tekla.Structures.Filtering.OperatorType.IS_NOT_EQUAL
The "is not equal" operator.

Tekla.Structures.Filtering.OperatorType.BOOLEAN_OR
The Boolean OR operator.

Tekla.Structures.Filtering.OperatorType.BOOLEAN_AND
The Boolean AND operator.

Tekla.Structures.Filtering.OperatorType.SMALLER_THAN
The "smaller than" operator.

Tekla.Structures.Filtering.OperatorType.SMALLER_OR_EQUAL
The "smaller or equal" operator.

Tekla.Structures.Filtering.OperatorType.GREATER_THAN
The "greater than" operator.

Tekla.Structures.Filtering.OperatorType.GREATER_OR_EQUAL
The "greater or equal" operator.

Tekla.Structures.Filtering.OperatorType.CONTAINS
The "contains" string operator.

Tekla.Structures.Filtering.OperatorType.NOT_CONTAINS
The "not contains" string operator.

Tekla.Structures.Filtering.OperatorType.STARTS_WITH
The "starts with" string operator.

Tekla.Structures.Filtering.OperatorType.NOT_STARTS_WITH
The "not starts with" string operator.

Tekla.Structures.Filtering.OperatorType.ENDS_WITH
The "ends with" string operator.

Tekla.Structures.Filtering.OperatorType.NOT_ENDS_WITH
The "not ends with" string operator.

Tekla.Structures.Filtering.OperatorType.EARLIER_THAN
The "earlier than" operator.

Tekla.Structures.Filtering.OperatorType.EARLIER_OR_EQUAL
The "earlier or equal" operator.

Tekla.Structures.Filtering.OperatorType.LATER_THAN
The "later than" operator.

Tekla.Structures.Filtering.OperatorType.LATER_OR_EQUAL
The "later or equal" operator.